In [ ]:
"""
Table: Person

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| PersonId    | int     |
| FirstName   | varchar |
| LastName    | varchar |
+-------------+---------+
PersonId is the primary key column for this table.
Table: Address

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| AddressId   | int     |
| PersonId    | int     |
| City        | varchar |
| State       | varchar |
+-------------+---------+
AddressId is the primary key column for this table.
 

Write a SQL query for a report that provides the following information for each person in the Person table, 
regardless if there is an address for each of those people:

FirstName, LastName, City, State
"""

In [ ]:
"""testcase"""
{"headers": {"Person": ["PersonId", "LastName", "FirstName"], "Address": ["AddressId", "PersonId", "City", "State"]}, 
 "rows": {"Person": [[1, "Wang", "Allen"]], "Address": [[1, 2, "New York City", "New York"]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Person;
DROP TABLE IF EXISTS Address;

CREATE TABLE Person(
PersonId  int(4) NOT NULL,
LastName varchar(32) NOT NULL,
FirstName varchar(32) NOT NULL,
PRIMARY KEY ('PersonId'));

CREATE TABLE Address(
AddressId int(4) NOT NULL,
PersonId  int(4) NOT NULL,
City varchar(32) NOT NULL,
State varchar(32) NOT NULL,
PRIMARY KEY ('AddressId'));

INSERT INTO Person VALUES
(1, 'Wang', 'Allen');

INSERT INTO Address VALUES
(1, 2, 'New York City', 'New York');

In [ ]:
"""SQL solution"""
# use left join to cover each person in table Person
SELECT FirstName, LastName, City, State
FROM Person AS p
LEFT JOIN Address AS a
ON p.PersonId = a.PersonId

In [1]:
"""pandas dataframe creation"""
import pandas as pd

Person = pd.DataFrame([[1, 'Wang', 'Allen']], columns=['PersonId', 'LastName', 'FirstName'])
Person.head()

   PersonId LastName FirstName
0         1     Wang     Allen

In [2]:
Address = pd.DataFrame([[1, 2, 'New York City', 'New York']], columns=['AddressId', 'PersonId', 'City', 'State'])
Address.head()

   AddressId  PersonId           City     State
0          1         2  New York City  New York

In [13]:
df = pd.merge(Person, Address, on='PersonId', how='left')
df.fillna('null', inplace=True)
# or: df = df.fillna('null')
df[['FirstName', 'LastName', 'City', 'State']]

  FirstName LastName  City State
0     Allen     Wang  null  null